Repository: sheilagomes/wp-trad
Catalog: tm/WP_blog_2.tmx
Source language: en
Languages: pt_br

source: WordPress 4.8.2 Security and Maintenance Release
pt_br: WordPress 4.8.2 – Atualização de segurança e manutenção

source: This is a security release for all previous versions and we strongly encourage you to update your sites immediately.
pt_br: Esta é uma atualização de segurança para todas as versões anteriores, recomendamos que você atualize seus sites imediatamente.

source: WordPress versions 4.8.1 and earlier are affected by these security issues:
pt_br: As versões 4.8.1 e anteriores foram afetadas pelos seguintes problemas de segurança:

source: $wpdb->prepare() can create unexpected and unsafe queries leading to potential SQL injection (SQLi).
pt_br: O método $wpdb->prepare() pode criar consultas inseguras e fora do esperado, permitindo SQL injection (SQLi), isto é, alterações no modo como o banco de dados é manipulado.

source: WordPress core is not directly vulnerable to this issue, but we’ve added hardening to prevent plugins and themes from accidentally causing a vulnerability.
pt_br: Os arquivos básicos do WordPress não são afetados por este problema, mas nós melhoramos o código para evitar que temas e plugins abram uma brecha de segurança acidentalmente.

source: Reported by Slavco
pt_br: Relatado por Slavco.

source: A cross-site scripting (XSS) vulnerability was discovered in the oEmbed discovery.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites (XSS, do inglês Cross-Site Scripting) descoberta na análise dos oEmbed (elementos incorporados automaticamente no texto).

source: Reported by xknown of the WordPress Security Team.
pt_br: Relatado por xknown da equipe de segurança do WordPress.

source: A cross-site scripting (XSS) vulnerability was discovered in the visual editor.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites foi descoberta no editor visual.

source: A path traversal vulnerability was discovered in the file unzipping code.
pt_br: Uma vulnerabilidade de exploração de diretórios (path traversal) foi descoberta no código de descompactação de arquivos.

source: A cross-site scripting (XSS) vulnerability was discovered in the plugin editor.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites foi descoberta no editor de plugins.

source: An open redirect was discovered on the user and term edit screens.
pt_br: Um redirecionamento sem validação foi encontrado nas telas de edição de termo e de usuário.

source: A path traversal vulnerability was discovered in the customizer.
pt_br: Uma vulnerabilidade de exploração de diretórios foi descoberta no Personalizar.

source: A cross-site scripting (XSS) vulnerability was discovered in template names.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites foi encontrada nos nomes dos templates.

source: A cross-site scripting (XSS) vulnerability was discovered in the link modal.
pt_br: Uma vulnerabilidade à execução de scripts de outros sites foi descoberta na janela de edição de links.

source: Thank you to the reporters of these issues for practicing responsible disclosure.
pt_br: Agradecemos a todos os que identificaram e relataram esses problemas pelo modo responsável como isso foi feito.

source: In addition to the security issues above, WordPress 4.8.2 contains 6 maintenance fixes to the 4.8 release series.
pt_br: Além destas questões de segurança, o WordPress 4.8.2 contém 6 ajustes de manutenção para a série de versões 4.8.

source: For more information, see the release notes or consult the list of changes.
pt_br: Para mais informações, leia as notas de lançamento ou consulte a lista de mudanças.

source: Download WordPress 4.8.2 or venture over to Dashboard → Updates and simply click “Update Now.”
pt_br: Faça o download do WordPress 4.8.2 ou navegue pelo Painel → Atualizações e clique em “Atualizar agora”.

source: Sites that support automatic background updates are already beginning to update to WordPress 4.8.2.
pt_br: Sites com suporte a atualizações automáticas em segundo plano já começaram a se atualizar para o WordPress 4.8.2.

source: Thanks to everyone who contributed to 4.8.2.
pt_br: Agradecemos a todos que contribuíram para a versão 4.8.2.
